//Напишите программу вычисления функции:
// x = f(a)


Console.WriteLine("Введите число: ");
string num = Console.ReadLine();
int numInt = Convert.ToInt32(num);
Console.WriteLine(numInt * numInt * numInt);

